In [1]:
import numpy as np
import pandas as pd

In [2]:
data={'Name':pd.Series(['Anju','Rimi','Amol','Amit','Shobha','Arnav','Abhi']),
       'Age':pd.Series([25,26,30,32,27,36,40]),
'Percentage':pd.Series([59.76,67.80,80,85,78.33,60,75])}

In [3]:
data

{'Name': 0      Anju
 1      Rimi
 2      Amol
 3      Amit
 4    Shobha
 5     Arnav
 6      Abhi
 dtype: object,
 'Age': 0    25
 1    26
 2    30
 3    32
 4    27
 5    36
 6    40
 dtype: int64,
 'Percentage': 0    59.76
 1    67.80
 2    80.00
 3    85.00
 4    78.33
 5    60.00
 6    75.00
 dtype: float64}

In [4]:
df=pd.DataFrame(data)
df

     Name  Age  Percentage
0    Anju   25       59.76
1    Rimi   26       67.80
2    Amol   30       80.00
3    Amit   32       85.00
4  Shobha   27       78.33
5   Arnav   36       60.00
6    Abhi   40       75.00

## Summary: and apply stat on df

In [5]:
df.sum()   #default axis=0 (columnwise)

Name          AnjuRimiAmolAmitShobhaArnavAbhi
Age                                       216
Percentage                             505.89
dtype: object

In [6]:
df

     Name  Age  Percentage
0    Anju   25       59.76
1    Rimi   26       67.80
2    Amol   30       80.00
3    Amit   32       85.00
4  Shobha   27       78.33
5   Arnav   36       60.00
6    Abhi   40       75.00

In [7]:
df.sum(axis=0)

Name          AnjuRimiAmolAmitShobhaArnavAbhi
Age                                       216
Percentage                             505.89
dtype: object

In [8]:
df.sum(axis=1)  #axis=1 works on rows

C:\Users\hakim\AppData\Local\Temp/ipykernel_8340/654170853.py:1: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  df.sum(axis=1)  #axis=1 works on rows

0     84.76
1     93.80
2    110.00
3    117.00
4    105.33
5     96.00
6    115.00
dtype: float64

In [9]:
25+59.76

84.75999999999999

#### if i want only single column and i want to perform sum()

In [10]:
df['Percentage'].sum() # it returns value

505.89

In [11]:
df[['Percentage']].sum() #it returns output in the form of Series

Percentage    505.89
dtype: float64

In [12]:
# if i want to apply sum on both columns
df[['Age','Percentage']].sum()

Age           216.00
Percentage    505.89
dtype: float64

In [13]:
df.loc[:,['Age','Percentage']].sum()

Age           216.00
Percentage    505.89
dtype: float64

In [17]:
df.loc[:4,['Age','Percentage']]

   Age  Percentage
0   25       59.76
1   26       67.80
2   30       80.00
3   32       85.00
4   27       78.33

In [18]:
df.loc[:4,['Age','Percentage']].sum()

Age           140.00
Percentage    370.89
dtype: float64

In [38]:
#df.drop(columns='Name').head()
#df.drop(columns='Name')[:5]
#df.drop(columns='Name').loc[:4]
#df.drop(columns='Name').iloc[:5]
#df.head()[['Age','Percentage']]
df[:5][['Age','Percentage']]

   Age  Percentage
0   25       59.76
1   26       67.80
2   30       80.00
3   32       85.00
4   27       78.33

In [40]:
df.iloc[:,1:].sum()

Age           216.00
Percentage    505.89
dtype: float64

In [42]:
df.sum()[['Age','Percentage']]

Age              216
Percentage    505.89
dtype: object

In [43]:
df.Age.sum(),df.Percentage.sum()

(216, 505.89)

In [44]:
df[['Age']].sum(),df[['Percentage']].sum()

(Age    216
 dtype: int64,
 Percentage    505.89
 dtype: float64)

In [45]:
df[['Age','Percentage']].sum(axis=1)

0     84.76
1     93.80
2    110.00
3    117.00
4    105.33
5     96.00
6    115.00
dtype: float64

In [46]:
#df['Age'].mean() #
df.mean()

C:\Users\hakim\AppData\Local\Temp/ipykernel_8340/1019139781.py:2: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  df.mean()

Age           30.857143
Percentage    72.270000
dtype: float64

In [47]:
df.mean()['Age']

C:\Users\hakim\AppData\Local\Temp/ipykernel_8340/3896524659.py:1: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  df.mean()['Age']

30.857142857142858

In [49]:
df.Age.mean()

30.857142857142858

In [53]:
df[['Percentage','Age']].mean()

Percentage    72.270000
Age           30.857143
dtype: float64

In [55]:
df.select_dtypes(['float64','int64'])

   Age  Percentage
0   25       59.76
1   26       67.80
2   30       80.00
3   32       85.00
4   27       78.33
5   36       60.00
6   40       75.00

## Assignment

In [ ]:
df.std()

In [ ]:
df.median()

In [ ]:
df.min()

In [ ]:
dfn=df[['Age','Percentage']]
dfn.cummax()

In [ ]:
df.cumsum()

In [ ]:
df.cumprod()

# Summarizing Data

In [56]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 3 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Name        7 non-null      object
 1   Age         7 non-null      int64
 2   Percentage  7 non-null      float64
dtypes: float64(1), int64(1), object(1)
memory usage: 296.0+ bytes

In [57]:
#check dtype of each colum
df.dtypes

Name           object
Age             int64
Percentage    float64
dtype: object

In [58]:
df.describe() #summarizes only numeric columns (default)

             Age  Percentage
count   7.000000    7.000000
mean   30.857143   72.270000
std     5.550633    9.941631
min    25.000000   59.760000
25%    26.500000   63.900000
50%    30.000000   75.000000
75%    34.000000   79.165000
max    40.000000   85.000000

In [59]:
df.describe().T

            count       mean       std    min   25%   50%     75%   max
Age           7.0  30.857143  5.550633  25.00  26.5  30.0  34.000  40.0
Percentage    7.0  72.270000  9.941631  59.76  63.9  75.0  79.165  85.0

In [60]:
df.describe().T[['min','max']]

              min   max
Age         25.00  40.0
Percentage  59.76  85.0

In [62]:
# if i want to use describe on all the columns
df.describe(include='O')

        Name
count      7
unique     7
top     Anju
freq       1

In [72]:
n = pd.DataFrame({'Name':['Dinesh','SHam','Pranay','Amit','Amit']})
n

     Name
0  Dinesh
1    SHam
2  Pranay
3    Amit
4    Amit

In [73]:
n.describe(include='O')

        Name
count      5
unique     4
top     Amit
freq       2

In [75]:
# if i want to count presence of each name
n.value_counts()

Name
Amit      2
Dinesh    1
Pranay    1
SHam      1
dtype: int64